// Во всех заданиях обязательно использовать рекурсию.
// 1. Написать функцию возведения числа в степень.

// 2. Написать функцию поиска наибольшего общего делителя.

// 3. Написать функцию для поиска максимальной цифры в числе.

// 4. Написать функцию, которая определяет простое ли переданное число.

// 5. Написать функцию для вывода всех множителей переданного числа в возрастающем порядке.
// Например: число 18 – множители 2 * 3 * 3.

// 6. Написать функцию, которая возвращает число Фибоначчи
// по переданному порядковому номеру.
// Числа Фибоначчи: 1, 1, 2, 3, 5, 8, 13… Ряд основывается на
// том, что каждое число равно сумме двух предыдущих чисел.
// Например: порядковый номер 3 – число 2, порядковый
// номер 6 – число 8.