using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WorldLord
{
    internal static class Text
    {


        public static string firstMessage = "Вы отправились в систему Процион на планету Боннасис. Это замечательная планета, она очень богатая и развитая." +
    "Правда, правительство этой планеты состоит сплошь из непрофессионалов и бездарей, которые бездумно расходуют ее обширные ресурсы и ведут планету к разорению." +
    "Было бы славно взять контроль над планетой в свои руки и править ею мудро и правильно, но по тамошним законам инопланетник не может стать вождем." +
    "Поэтому вы должны будете найти способ захватить власть любым другим путем кроме законного. Одним словом, вы должны завоевать для нас мир!";

        public static string secondMessage = "Как только вы прошли положенные процедуры таможенного досмотра и покинули космопорт, к вам подошли двое неизвестных. " +
    "Один был нетипично крепок и мускулист. Приблизившись к вам, он слегка поклонился и стал смотреть на вас сквозь непроницаемые очки. " +
    $"Другой, который был несколько ниже крепыша, принялся пожимать вам руки.\n- Добро пожаловать! Я думаю, вам уже известна суть вашего непростого задания. " +
    "Мы сейчас отвезем вас на вашу базу. Я - ваш советник, Ихорь. Это - ваш личный телохранитель, мастер боевых искусств и плазменного разрядника, его имя - Артэллон.\n" +
    "Молчаливый телохранитель снова слегка поклонился и, задрав рукав, продемонстрировал вам закрепленный на запястье плазменный разрядник.\nТем временем вы подошли к транспортной трубе, " +
    "где вас уже дожидался длинный черный флаер. Артен почтительно открыл перед вами дверцу, подозрительно оглядываясь по сторонам. " +
    "Когда вы устроились как следует, Ихорь поднял флаер в воздух и помчался в сторону моря. Мимо стремительно пролетали морские просторы планеты Боннасис.";

        public static string thirdMessage = "Примерно через полчаса полета на горизонте показался тропический остров. Флаер стал снижаться. Слишком быстро снижаться. " +
    "Ихорь беззаботно направил его практически вертикально вниз. Зеленая тропическая растительность приближалась с катастрофической быстротой. " +
    "Вы уже собирались заорать и вырвать из рук пеленга штурвал, когда пальмы внизу разъехались в стороны, открыв посадочный тоннель. " +
    "Флаер плавно вошел в него и скоро остановился в подземном ангаре. Ихорь заглушил двигатели, и телохранитель любезно открыл перед вами дверь. " +
    "Выбравшись из флаера, вы отправились внутрь базы. По пути вам несколько раз встретились какие-то рабочие, отдававшие при виде вас честь.\n" +
    "Наконец советник остановился перед одной из дверей, автоматически отъехавшей в сторону.\n- Прошу сюда.\n" +
    "Вы зашли в помещение и сразу увидели большой внушительный стол. Вы уселись в шикарное вращающееся кресло и сделали пару оборотов. " +
    "Повернувшись к столу, вы заметили множество экранчиков, на которые, похоже, транслировалось изображение с камер, установленных по всей базе. Телохранитель тут же встал справа от вас, " +
    "а Ихорь сел на неудобный стул, стоявший напротив вашего стола.\n- Если у вас есть какие-то вопросы, задавайте! Как-никак, я пока что ваш советник, я всегда к вашим услугам!\n";

        public static string firstMenu = "1. Откуда я буду брать деньги?\n2. Что мне нужно, чтобы завоевать мир?\n3. Как отнесется правительство к нашим делам?\n" +
        "4. Кто будет на меня работать?\n5. Ты свободен, можешь идти, а мне пора завоевывать мир";
        public static string firstMenuFirstMessage = "- Деньги, разумеется, придут из бюджета планеты Боннасис. Все, что от вас требуется, - организовать ограбление какого-нибудь крупного банка планеты, " +
                "послав на задание ваших миньонов. Вы, конечно, понимаете, что лучше всего грабить умеют военные. Учтите, что правительство планеты будет чрезвычайно зло " +
                "на вас за эти ограбления. Если вы не хотите будоражить правительство, вы можете попробовать какие-нибудь менее незаконные способы, чем ограбления. " +
                "Но ни один из них не будет столь же прибыльным.\nОбязательно следите за бюджетом и ни в коем случае не давайте казне опустеть! " +
                "Неизвестно, какую реакцию у миньонов может вызвать отсутствие денег. И лучше бы вам это не проверять.";
        public static string firstMenuSecondMessage = "- О, все очень просто! Вы должны разработать Адскую Машину, с помощью которой вы поставите на колени всю эту планету. " +
                "Над созданием Адской Машины будут работать ученые, и на это уйдет немало времени. Когда проект \"Адская Машина\" будет готов, вам понадобятся ресурсы для " +
                "ее постройки, на это вам придется потратить еще немного времени, денег и нервов. Если у вас будет Адская Машина, считайте, что планета у вас в кармане.";
        public static string firstMenuThirdMessage = "- Ну... Власти будут недовольны. Если вы совсем разозлите их, они, возможно, подошлют к вам агентов, которые постараются разрушить " +
                "вашу базу и убить вас. Чтобы не допустить этого, вы должны заранее позаботиться об охране базы.";
        public static string firstMenuFourthMessage = " - На базе работает несколько видов миньонов. Среди них есть военные, рабочие и ученые. Военные будут заботиться о безопасности " +
                "вашей базы и вашей лично. Кроме того, они хороши при вооруженных ограблениях. Рабочие будут прислуживать вам, и заниматься строительством вашей базы. " +
                "Ну а ученые, как вы понимаете, должны будут разработать для вас Адскую Машину.\nДолжен вам сказать, что вам не стоит совсем уж пренебрежительно относиться " +
                "к жизни своих миньонов. Дело в том, что они могут поднять мятеж, если условия их работы будут совсем низки. Уровень почтительности миньонов будет снижаться, " +
                "если вы не позаботитесь о развлечениях.";
        public static List<string> firstMenuCommand = new List<string>()
        {
            firstMenuFirstMessage, firstMenuSecondMessage, firstMenuThirdMessage, firstMenuFourthMessage
        };
        public static string mainMenu = "1. Нанимать или увольнять миньонов.\n" +
                "2. Организовать ограбление.\n" +
                "3. Зарабатывать деньги другим путем.\n" +
                "4. Строить узлы базы.\n" +
                "5. Всё идет хорошо, можно лечь спать.\n";
        public static string hellMAchineMenu = mainMenu + "6.Купить детали к Адской Машине";
        public static string redButton = hellMAchineMenu + "\n7. Нажать на красную кнопку";
        public static string mainMenuFirstMessage = "- Начальника отдела кадров ко мне! Сейчас же! - заорали вы в микрофон. Скоро послышался чей-то дробный топот, " +
                    "и в кабинет вбежал взмыленный офисный рабочий с лаптопом, который он крепко ухватил всеми руками. Слегка поклонившись вам, он положил лаптоп на ваш стол.\n" +
                    "- Добрый день, сэр! Вот список всех служащих вашей базы. Вот прайс-лист, на нем можно увидеть текущие расценки на найм миньонов. С этими словами " +
                    "он положил рядом с лаптопом полупрозрачный пластиковый листок.\r\n \"Рабочие. Занимаются обслуживанием базы. Для постройки и содержания узлов " +
                    "необходимо иметь достаточное число рабочих. Стоимость найма одного рабочего - 2000 cr.\r\n Военные. Основа безопасности базы. Защищают ее во " +
                    "время атак, также высылаются на континент с целью ограбления банков и пополнения бюджета организации. Стоимость найма одного военного - 3000 cr.\n" +
                    "Ученые. Самые светлые умы планеты Боннасис, согласившиеся работать на вас. Необходимы для создания проекта и постройки Адской Машины. Стоимость " +
                    "найма одного ученого - 4000 cr.\n" +
                    "- Что желаете сделать, сэр? Нанять кого-нибудь? Или уволить?\n\n";
        public static string mainMenuFirstMenu = "1. Рабочий\n2. Военный\n3. Ученый\n4. Увольнять миньонов\n5. Я передумал и больше не хочу никого нанимать";
        public static string mainMenuFirstMenuFirstMessage = "Сколько миньонов Вы хотите нанять?";
        public static string mainMenuFirstMenuFourthMessage = "Сколько миньонов Вы хотите уволить?";
        public static string mainMenuFirstMenuFourthMessageFourthMessage = "1. Рабочий\n2. Военный\n3. Ученый\n4. Я передумал и больше не хочу никого увольнять";
        public static string mainMenuFirstMenuError = "Недостаточно денег или места для миньонов";
        public static string heist = "Вы схватили микрофон и не отказали себе в удовольствии повысить громкость до предела. " +
            "Сделав это маленькое злобное деяние, вы поднесли микрофон поближе и гаркнули в него погромче:\n- ВНИМАНИЕ, ВОЕННЫЕ МИНЬОНЫ!!! " +
            "НАЧАТЬ ПОДГОТОВКУ К ОГРАБЛЕНИЮ!!!\n" +
            "Не прошло и минуты, как в кабинет строевым шагом вошел увешанный медалями командир гарнизона базы.\n  - " +
            "Командующий Вашими войсками генерал Побаш Ке прибыл! - проорал он не хуже вас.\n Подождав, пока он вволю " +
            "накозыряется и нащелкается каблуками, вы приказали ему начать подготовку к ограблению.\n- Так точно, командир Злой Гений! " +
            "Начинаю подготовку. Утвердите количество военных, отправляющихся на задание. Разрешите доложить, что ресурсы базы не позволяют " +
            "нам проводить более одного ограбления или любой другой операции по добыче денег в день. Однако награбленные деньги, а " +
            "также уцелевшие солдаты вернутся в тот же день, спустя несколько часов - все солдаты генерала Побаш Ке проводят операции " +
            "молниеносно! Должен напомнить, что чем выше ненависть правительства к нашей организации, тем выше риск для солдат! Но мои " +
            "ребята, даже если все до единого полягут, всегда успеют отправить вам выручку!\r\n Закончив свою пламенную речь, генерал " +
            "протянул вам лаптоп с личным боевым составом базы.";
        public static string heistResult = "- Так точно, сэр! - еще ужаснее прежнего проорал генерал. - Разрешите начать операцию?\n" +
            "Дождавшись разрешения, Побаш Ке еще немного пощелкал каблуками и поотдавал честь, после чего вышел. Вы стали наблюдать за " +
            "тем, как военные миньоны снаряжаются и садятся в десантный флаер. Скоро он взлетел и отправился к материку.\n Буквально " +
            "полчаса спустя встроенный в стену стереовизор ожил и принялся транслировать новости. Взволнованный журналист указывал на " +
            "дымящееся здание одного из крупнейших банков планеты Боннасис и бормотал что-то о вооруженных столкновениях. Еще полчаса " +
            "спустя на счет организации стали поступать кредиты.";
        public static string trading = " Сплетая и расплетая пальцы, вы уставились на запись расходов на сегодняшний день. " +
            "Она была угрожающе большой. Вы включили интерком и вызвали в кабинет экономиста, угрожая скормить его пираньям. " +
            "Стоило его побледневшему лицу исчезнуть с экрана, как он сам собственной персоной влетел в кабинет.\n- Миньон, " +
            "как мы можем заработать деньги, не привлекая к делу военных? - равнодушно вопросили вы, поигрывая маленькой виселицей.\n" +
            "Экономист просиял. Нечестные методы заработка были его коньком.\n  - Да, Владыка, я как раз недавно разработал одну " +
            "интересную концепцию... - зачастил он.\n Вы угрожающе покачали висельной петлей.\n  - Дело в том, что мы можем путем " +
            "нехитрых манипуляций закупать товары на экваторе планеты, а продавать на полюсах... Как вы знаете, ускорение свободного" +
            " падения на полюсе в силу не идеально круглой формы планеты выше, чем на экваторе... Таким образом, вес купленного товара" +
            " будет увеличиваться, и вся выгода от этого будет нашей! Правда, здорово?";
        public static string tradingNext = "Экономист аж засветился изнутри от радости.\n  - Спасибо, Владыка! Теперь нужно уточнить " +
            "несколько моментов. Дело в том, что мы можем купить несколько видов товаров и экспортировать их в несколько разных городов, " +
            "расположенных на полюсе. Загвоздка в том, что мы никогда не можем быть уверены, будет ли спрос на данный товар в данном городе. " +
            "Это лотерея, милорд. Если нам повезет, добыча будет хорошей. Если спрос будет низкий, то и наш доход будет невелик. " +
            "Если же спроса не будет, мы можем остаться вовсе без дохода. Разумеется, чем больше рабочих вы отправите на задание, " +
            "тем больше денег получите. Однако ограбление в любом случае останется более выгодным делом... Кстати, должен вам напомнить - " +
            "как и в случае с ограблением, мы не можем провести более одной операции по добыче денег в день.\n  - Хорошо, давай уже начинать.";
        public static string mainMenuSecondMenuFirstMessage = "Сколько миньонов отправить на ограбление?";
        public static string tradingGoods = "- Хорошо, сэр! - экономист застрочил стилом в своем блокноте. - Теперь вам необходимо выбрать " +
            "один из видов товаров, которым мы будем спекулировать. Вот, возьмите списочек.\n \"Список доступных товаров:\n 1) Странные Штуковины " +
            "Непонятной Формы\n 2) Какие-то Зеленые Прибамбасы\n 3) Кривые И Гнутые Железяки\n 4) Длинные Палки Со Странными Загогулинами На Конце\n " +
            "5) Круглые Предметы С Дырками Посередине\n 6) Необычная Липкая Дрянь\"";
        public static string tradingTowns = "- Благодарю, сэр! В какой город следует ввозить данные товары? Вот список находящихся на полюсе городов.\n " +
            "\"1) Лайт-Бринг-Сити\n 2) Дрейкбург\n 3) Эйслэнд\n 4) Леосания\n 5) Гелитаун\n 6) Пяткинск\"";
        public static string baseBuild = "Вы проорали в микрофон, что желаете немедленно видеть начальника строительного отдела. " +
            "Через несколько минут дверь распахнулась, и в кабинет вошел запыхавшийся человек в строительной форме. Отдав честь, " +
            "он робко уселся на стул напротив вашего внушительного стола.\n  - Немедленно начать строительство базы! - гаркнули " +
            "вы, сверкая моноклем.\n  - Так точно! Что будем строить? - Строитель извлек из кармана маленький гало-проектор и спроектировал " +
            "чертежи основных устройств прямо в воздух. - Осмелюсь напомнить вам, босс, что для строительства какого-либо узла нужно иметь " +
            "достаточно денег для постройки и необходимое число рабочих на базе для обслуживания узла. Если чего-то не хватает, узел не будет " +
            "построен. Да, и еще одно - ресурсы нашей базы позволяют нам построить не более одного узла в день...\n С этими словами он дрожащими " +
            "руками протянул вам прайс-лист.\n \"Бараки. Обеспечивают жилыми местами 20 миньонов. Если не хватает жилых мест, найм новых миньонов невозможен.\n " +
            "Стоимость - 40000 cr. Рабочие миньоны - 3.\n Лаборатории. Обеспечивают ученых местами для исследований. Чем больше лабораторий, " +
            "тем выше скорость исследований по созданию Адской Машины. При отсутствии лабораторий научные работы замораживаются.\n Стоимость - 60000 cr. Рабочие миньоны - 5." +
            "\n Комнаты отдыха. Здесь ваши миньоны могут отдыхать и восстанавливать силы. Чем больше на базе комнат отдыха, тем " +
            "больше почтительность миньонов.\n Стоимость - 50000 cr. Рабочие миньоны - 3\".";
        public static string baseDemolish = " - Снести... Конечно... - строитель пощелкал своим проектором и наконец вывесил перед вами список уже построенных узлов. " +
            "- Мы готовы в любой момент снести лишний узел, если вам нужно место для постройки какого-то другого узла. Однако здесь есть одно ограничение " +
            "- снести бараки не получится, если они используются миньонами. Нужно просто уволить миньонов - тогда барак опустеет, и мы сможем его снести.";
        public static string socialAttack = "Вы уже было устроились на своей огромной кровати с пологом на четырех столбиках, сделанных из самой настоящей " +
            "гранэкской секвойи (или рамгатрского баобаба?) и приготовились погрузиться в сон, когда пронзительно завизжал зуммер на столе. Выругавшись, " +
            "вы подошли к столу. На экране переговорника виднелось пожелтевшее от волнения лицо Ихоря.\n  - Сэр, критическая ситуация! Вооруженные силы " +
            "правительства атакуют остров!\n Сон с вас мигом слетел. Вы нажали на Большую Желтую Кнопку (Большая Красная Кнопка была предназначена для " +
            "запуска Адской Машины). По всей базе разом завыли сирены, из бараков стали выбегать военные, на ходу облачаясь в легкие боевые скафандры. " +
            "Генерал Побаш Ке могучими воплями сгонял их к орудийным турелям.\n  - Сэр, у нас есть несколько путей защиты, - надрывался с переговорника Ихорь. " +
            "- Мы можем полностью законсервировать базу - закапсулировать все тоннели, пустить ядовитый газ и обвалить вход на базу. Однако это почти наверняка " +
            "вызовет серьезные жертвы среди персонала, а взрыв может повредить элементы Адской Машины. Если вас это не устраивает, вы можете отдать военным " +
            "приказ на защиту базы... Однако если все военные погибнут, враги пробьются на базу и попытаются убить вас!\n Собравшись с мыслями, вы стали выбирать стратегию защиты.";
        public static string socialAttackDef = "Вдали постоянно слышались взрывы и частый треск стационарных орудий. База то и дело содрогалась от " +
            "попаданий тяжелого оружия противника. В вашем кабинете все время мигал свет, сыпалась с потолка побелка. Наконец шум боя смолк. Вы было " +
            "обрадовались, но тут раздался оглушительный взрыв на самой базе. Один из экранов показал, как в потоках огня исчезла главная входная дверь. " +
            "В дисплее коммуникатора возник Ихорь. Он был в панике.\n  - Сэр, враги прорвали внешний периметр и сейчас двигаются по направлению к " +
            "вашему укрытию! Все наши солдаты погибли! Генерал Побаш Ке заблокирован взрывом в бункере и не может прийти вам на помощь! Вам необходимо срочно спасаться!\n" +
            "За вашей спиной из ниоткуда появился Артэллон. Он встал рядом с дверью и активировал оба плазменных разрядника. Вы направились к секретному ходу, ведущему в укрытие...";
        public static string socialAttackOver = " Вы не успели даже открыть секретный ход, когда вражеские агенты ворвались в кабинет. " +
            "Артэллон шагнул из тени вперед, вскидывая руки. От плазменных разрядников на запястьях по атакующим ударили два ослепительно " +
            "белых хлыста. Однако агентов было слишком много - ввалившись целой толпой, они открыли плотный огонь по Артэлону, и он упал. " +
            "Разгоряченные дула лазерных винтовок направились на вас... Это было последнее, что вы видели в своей жизни.";
        public static string conservation = "- Всему персоналу, желтая тревога! - прогремели вы в микрофон. - Начать немедленную консервацию базы! " +
            "Всем незанятым в консервации миньонам занять места в бараках и применить средства индивидуальной защиты!\n С чувством выполненного долга, " +
            "вы стали наблюдать за воцарившейся на базе активностью. Все коридоры базы перекрывались тяжелыми герметичными дверьми. " +
            "Ближайшие к входу коридоры стали заполняться едким ядовитым газом. К сожалению, некоторые из миньонов не успели покинуть зону поражения и отравились газом.\n " +
            "Неожиданно прогремел далекий взрыв - это погребло под камнями основной вход на базу. При взрыве погибло несколько миньонов, " +
            "да и лабораториям с их чувствительной аппаратурой досталось, но никто из врагов так и не смог попасть на базу.\n Через несколько часов, когда атака " +
            "прекратилась, с вами снова связался Ихорь.\n  - Сэр, атака на базу полностью отражена! У нас есть некоторые жертвы среди личного состава, " +
            "кроме того, утрачено несколько ценных разработок в области проекта АМ. Однако все основные системы базы в порядке, сэр! Миньоны уже начали " +
            "разбирать завал на месте главного входа.\n Вы выключили переговорник и направились к своей монументальной кровати. Надо, молгаар их всех возьми, вздремнуть!";
        public static string minionsRage = "В кабинет неожиданно без спросу ворвался взмыленный Ихорь. Вы начали привставать с кресла, " +
            "чтобы гневно обругать его за наглое обращение, но он в панике закричал:\n- Сэр, миньоны взбунтовались! Они заявляют, что не хотят служить под началом " +
            "Злого Гения, который потратил все свои деньги! Вам лучше бежать!\n Действительно, на экранах своего стола вы видели множество миньонов, " +
            "громящих лаборатории и комнаты отдыха. Не теряя времени, вы пробрались в ангар через секретный ход и как можно скорее покинули базу на десантном флаере. Мир теперь не станет вашим...";
        public static string hellMachine = "\"Получив все компоненты Адской Машины, Вы сможете нажать на красную кнопу и захватить всю власть на планете, тем самым выиграв игру!\"";
        public static string mainMenuSecondMenuError = "Недостаточно военных";
        public static string mainMenuFourthMenuMessage = "Бараки. Обеспечивают жилыми местами 20 миньонов. Если не хватает жилых мест, найм новых миньонов невозможен.\n" +
                    "Стоимость - 40000 cr. Рабочие миньоны - 3.\n\n" +
                    "Лаборатории. Обеспечивают ученых местами для исследований. " +
                    "Чем больше лабораторий, тем выше скорость исследований по созданию Адской Машины. " +
                    "При отсутствии лабораторий научные работы замораживаются.\nСтоимость - 60000 cr. " +
                    "Рабочие миньоны - 5.\n\nКомнаты отдыха. Здесь ваши миньоны могут отдыхать и восстанавливать силы. " +
                    "Чем больше на базе комнат отдыха, тем больше почтительность миньонов.\nСтоимость - 50000 cr. Рабочие миньоны - 3";
        public static string mainMenuFifthMenuCase = "Жители планеты слишком недовольны Вашими действиями и решили напасть на Вашу базу. Вы можете " +
                                "отдать приказ военным на защиту базы, однако если все военные погибнут, враги пробьются на базу и попытаются убить вас. Либо законсервировать базу -" +
                                " закапсулировать все тоннели, пустить ядовитый газ и обвалить вход на базу. Однако это почти наверняка вызовет серьезные жертвы среди персонала," +
                                " а взрыв может повредить элементы Адской Машины";
        public static List<string> randomText = new List<string>()
                    {
                        "Вам внезапно взбрело в голову отпраздновать свой день рождения, хотя был он вовсе даже и не сегодня. " +
                        "Впрочем, это не помешало вам устроить маленькую вечеринку с участием генерала Побаш Ке, Артэллона, " +
                        "Ихоря и некоторых приближенных миньонов. Под крики \"Сюрприз!\" в кабинет вкатили огромный праздничный торт, и " +
                        "вы тут же принялись рубить его на большие неровные куски, как вдруг оттуда раздались громкие вопли. Оказалось, " +
                        "что внутри торта пряталась танцовщица. К счастью для нее, вы не успели ее задеть, так что она отделалась легким " +
                        "испугом.\nКогда вечеринка закончилась, вы, позевывая, вернулись к делам.\n\n",

                        "Подчиняясь внезапной прихоти, вы распорядились выпустить в воду главного бассейна выводок Пираний-Мутантов, " +
                        "рассудив, что у каждого порядочного злодея должен быть водоем с подобными тварями. \nПоскольку пленного " +
                        "секретного агента под рукой не оказалось, вы скормили рыбам пластиковый манекен, набитый кормом. " +
                        "Зрелище было впечатляющее, только очень недолгое. Пираньи-Мутанты уничтожили ваше угощение за считанные " +
                        "секунды, вместе с пластиком, одеждой и куском железной цепи, на котором все это дело опускалось в бассейн. " +
                        "Пришлось подготовить еще несколько манекенов, чтобы рассмотреть процесс детально.\nВы все пичкали и пичкали " +
                        "их кормом, так что под конец сытые и благодушные рыбы даже не глянули в сторону рабочего, случайно свалившегося " +
                        "в воду. Сочтя свой долг перед живой природой исполненным, вы вернулись к себе в кабинет и уселись в кресло.\n\n",

                        " Вы от нечего делать стали нажимать кнопочки на пульте. Вы нажимали их до тех пор, пока вам не стало ясно, " +
                        "что мировое господство этим не приблизить. Осознав это, вы вышли из себя и, схватив стул, стали с упоением " +
                        "разбивать им экраны. Потом вы немного попрыгали на пульте, сминая его, потом ловко перегрызли торчащие провода, " +
                        "затем, крякнув, оторвали пульт от пола и разбили о стену. Успокоившись, вы приказали доставить к себе в кабинет " +
                        "новый пульт. Когда он, точная копия предыдущего, появился, вы спокойно вернулись к работе.\n\n",

                        "Вы тоскливо оглядели свой кабинет. Вам упорно казалось, что для полного образа Злого Гения вам не хватает какой-то детали. " +
                        "После долгих раздумий вас наконец осенило - конечно, вам нужен белый кот! Вы тут же заказали его в кабинет." +
                        " К сожалению, на острове не нашлось белых котов, и вам доставили маленького шпецокляка. Шпецокляк был совсем не " +
                        "белый и абсолютно не пушистый. Когда вы попытались его погладить, он прилип к вашей руке. Вы принялись остервенело трясти ею. " +
                        "Шпецокляк оторвался и усвистел в коридор. Приказав поймать его и подать на ужин, вы вернулись к работе, украдкой вытирая оскверненную руку о стоящего рядом Артэллона.\n\n",

                        "Вам почему-то приспичило завести видеодневник, чтобы рассказывать в нем о своей нелегкой злодейской доле. " +
                        "Вы все говорили и говорили о своем детстве, о том, как решили пойти в рейнджеры, как стали злым гением... " +
                        "Потом вам вдруг показалось, что все потомки до единого недостойны видеть ваш дневник, и вы на всякий случай " +
                        "вмонтировали в него гипнотическую ловушку, которая должна была убить любого, кто посмотрит запись. Самоутвердившись " +
                        "таким образом, вы бросили дневник в утилизатор и вернулись к работе.\n\n",

                        "Вы поудобнее устроились в кресле и подтянули к себе микрофон, глядя в экранчики на своем столе. " +
                        "Миньоны бегали по базе, рабочие работали, ученые изучали, военные тренировались. Словом, идиллия! " +
                        "Мир совсем скоро падет к вашим ногам.\nИтак, какие на сегодня отдадим приказания?\n\n",

                        "Решив пополнить свой запас знаний, вы стали читать мемуары вашего предшественника, злого гения по имени Борж Джуш, " +
                        "который практически захватил планету, но был позорно побежден силами добра. Как оказалось, его сгубила привычка злобно и " +
                        "маниакально хохотать - в момент приступа хохота он подавился трюфелями и умер. Пообещав себе на досуге подумать о вреде маниакального хохота, вы вернулись к работе.\n\n",

                        "Вы некоторое время посидели за столом, нажимая для виду на разные кнопочки. Потом вам стало скучно, и вы решили потренировать перед зеркалом свой злодейский смех. " +
                        "Вы все хохотали и хохотали, пока в кабинет не ввалился срочно вызванный с материка психиатр (после этого вы захохотали гораздо громче и искренней). " +
                        "Доведя психиатра до нервного припадка, вы остались довольны и снова уселись за стол. Пора продолжать работу!\n\n",
                    };
        public static string DrawInConsoleBox(string b, string r, string t)
        {

            string vertical = "║";
            string horizontal = "═";

            string newTop = String.Empty;
            int newTopCount = 0;
            foreach (var text in t)
            {
                newTop += text;
                newTopCount++;
                if (newTopCount == 140)
                {
                    newTop += "\n";
                    newTopCount = 0;
                }
            }
            t = newTop;
            string[] rLines = r.Split(new char[] { '\r', '\n' }, StringSplitOptions.RemoveEmptyEntries);
            string[] tLines = t.Split(new char[] { '\r', '\n' }, StringSplitOptions.RemoveEmptyEntries);
            string[] bLines = b.Split(new char[] { '\r', '\n' }, StringSplitOptions.RemoveEmptyEntries);


            //int longest = 0;
            //foreach (string line in tLines)
            //{
            //    if (line.Length > longest)
            //        longest = line.Length;
            //}
            int width = 150; // 1 space on each side
                             //if (width < 150)
                             //{
                             //    width = 150;
                             //}

            string h = string.Empty;
            string bonusH = string.Empty;
            string bottom = string.Empty;
            for (int i = 0; i < width; i++)
            {
                bonusH += ".";
                h += horizontal;
                //bottom += " ";
                if (i + 1 == width)
                {
                    h += vertical;
                    bonusH += vertical;
                    //bottom += vertical;
                }
            }

            // box top
            StringBuilder sb = new StringBuilder();
            //sb.AppendLine(h);

            int stringCount = 0;
            int rLinesCount = 0;
            // box contents
            foreach (string line in tLines)
            {
                double dblSpaces = (((double)width - (double)line.Length) / (double)2);
                int iSpaces = Convert.ToInt32(dblSpaces);

                if (dblSpaces > iSpaces) // not an even amount of chars
                {
                    iSpaces += 1; // round up to next whole number
                }

                string beginSpacing = "";
                string endSpacing = "";
                for (int i = 0; i < iSpaces; i++)
                {
                    beginSpacing += " ";

                    if (!(iSpaces > dblSpaces && i == iSpaces - 1)) // if there is an extra space somewhere, it should be in the beginning
                    {
                        endSpacing += " ";
                    }
                }

                // add the text line to the box
                if (rLinesCount != rLines.Length)
                {
                    sb.AppendLine(line + endSpacing + beginSpacing + vertical + rLines[rLinesCount]);
                    rLinesCount++;
                }
                else { sb.AppendLine(line + endSpacing + beginSpacing + vertical); }
                //sb.AppendLine(beginSpacing + bLines[0] + endSpacing + " " + vertical);
            }

            // box bottom
            stringCount = rLines.Count();
            for (int i = 0; i < stringCount; i++)
            {
                if (rLinesCount != rLines.Length)
                {
                    sb.Append(bonusH);
                    //for (int j = 0; j < h.Length - 1; j++)
                    //{
                    //    sb.Append(' ');
                    //}
                    //sb.Append(vertical);
                    sb.AppendLine(rLines[rLinesCount]);
                    rLinesCount++;
                    //bLineCheck = true;
                }
                sb.AppendLine(bonusH);
            }
            sb.AppendLine(h);
            int bLineCount = 0;
            //bool bLineCheck = true;
            while (bLineCount != bLines.Length)
            {
                if (bLineCount != bLines.Length)
                {
                    //bLineCheck = false;
                    sb.Append(bLines[bLineCount]);
                    for (int j = 1; j < h.Length - bLines[bLineCount].Length; j++)
                    {
                        sb.Append(".");
                    }
                    bLineCount++;
                    sb.AppendLine(vertical);
                }
            }
            for (int j = 0; j < stringCount; j++)
            {
                sb.AppendLine(bonusH);
            }

            // the finished box
            return sb.ToString();
        }
    }
}
